{
  "Argument" : {"term": "Argument", 
          "df": "a connected series of statements designed to convince an audience of another statement"
          },
   "Artificial" : {"term": "Artificial language", 
          "df": "A language that was consciously developed by identifiable individuals for some purpose."
          },
    "Cogent": {"term":"Cogent", 
    	"df" : "A property of arguments that holds when the argument is strong and the premises are true."
    },
    "Conclusion": {
    	"term":"Conclusion", 
    	"df": "the statement that an argument is trying to convince an audience of."
    },
    "Consistency":{
    	"term":"Consistency",
    	"df": "A property possessed by a set of sentences when they can all be true at the same time, but are not necessarily so."
    },
    "Contingent":{
    	"term":"Contingent statement",
    	"df": "A statement that is neither a tautology nor a contradiction. "
    },
    "Contradiction":{
    	"term":"Contradiction",
    	"df": "A statement that must be false, as a matter of logic."
    },
    "Deductive":{
    	"term":"Deductive",
    	"df": "A style of arguing where one attempts to use valid arguments."
    },
    "Explanation":{
    	"term":"Explanation",
    	"df": "A kind of reasoning where reasons are used to provide a greater understanding of something that is already known. "
    },
    "Formal logic":{
    	"term":"Formal logic ",
    	"df": "A way of studying logic that achieves content neutrality by replacing parts of the arguments being studied with abstract symbols. Often this will involve the construction of full formal languages."
    },
    "Inconsistency":{
    	"term":"Inconsistency",
    	"df": "A property possessed by a set of sentences when they cannot all be true at the same time, but they may all be false at the same time."
    },
    "Inductive":{
    	"term":"Inductive",
    	"df": "A style of arguing where one attempts to use strong arguments. "
    },"Invalid":{
    	"term":"Invalid",
    	"df": "A property of arguments that holds when the premises do not force the truth of the conclusion. The opposite of valid. "
    },
    "Logic":{
    	"term":"Logic",
    	"df": "the part of the study of reasoning that focuses on argument. "
    },
    "Valid":{
    	"term":"Valid",
    	"df": "A property of arguments where it is impossible for the premises to be true and the conclusion false"
    },
    "Truth Value":{
    	"term":"Truth Value",
    	"df": "The status of a statement with relationship to truth. In our context, this means the status of a statement as true or false"
    },
    "Premise":{
    	"term":"Premise",
    	"df": "a statement in an argument that provides evidence for the conclusion"
    }
    
    
    




}