{
    "Antecedent": {
        "term": "Antecedent",
        "df": "The sentence to the left of a conditional"
    },
    "Atomic sentence": {
        "term": "Atomic sentence",
        "df": "A sentence that does not have any sentences as proper parts."
    },
    "Biconditional": {
        "term": "Biconditional",
        "df": "The symbol ↔, used to represent words and phrases that function like the English phrase 'if and only if'."
    },
    "Complete truth table": {
        "term": "Complete truth table",
        "df": "A table that gives all the possible interpretations for a sentence or set of sentences in SL.."
    },
    "Conditional": {
        "term": "Conditional",
        "df": "The symbol →, used to represent words and phrases that function like the English phrase “if . . . then.” "
    },
    "Conjunct": {
        "term": "Conjunct",
        "df": "A sentences joined to another by a conjunction. "
    },
    "Conjunction": {
        "term": "Conjunction",
        "df": "The symbol used to represent words and phrases that function like the English word 'and'"
    },
    "Consequent": {
        "term": "Consequent",
        "df": "The sentence to the right of a conditional. "
    },
    "Disjunct": {
        "term": "Disjunct",
        "df": " A sentences joined to another by a disjunction. "
    },
    "Disjunction": {
        "term": "Disjunction",
        "df": "The symbol ∨, used to represent words and phrases that function like the English word“ or” in its inclusive sense."
    },
    "Interpretation": {
        "term": "Interpretation",
        "df": "A correspondence between nonlogical symbols of the object language and elements of some other language or logical structure. "
    },
    "Logical symbol": {
        "term": "Logical symbol",
        "df": "A symbol that has its meaning fixed by the formal language. "
    },
    "Main connective ": {
        "term": "Main connective",
        "df": "The last connective that you add when you assemble a sentence using the recursive definition."
    },
    "Metalanguage": {
        "term": "Metalanguage",
        "df": "The language logicians use to talk about the object language. "
    },
    "Metavariables": {
        "term": "Metavariables",
        "df": "A variable in the metalanguage that can represent any sentence in the object language. "
    },
    "Negation": {
        "term": "Negation",
        "df": "The symbol ¬, used to represent words and phrases that function like the English word “not”. "
    },
    "Recursive definition": {
        "term": "Recursive definition",
        "df": "A definition that defines a term by identifying base class and rules for extending that class. "
    },
    "Scope": {
        "term": "Scope",
        "df": "The sentences that are joined by a connective. These are the sentences the connective was applied to when the sentence was assembled using a recursive definition.  "
    },
    "Semantic contradiction in SL": {
        "term": "Semantic contradiction in SL",
        "df": " A statement that has only Fs in the column under the main connective of its complete truth table. "
    },
    "Semantic tautology": {
        "term": "Semantic tautology",
        "df": "A statement that has only Ts in the column under the main connective of its complete truth table. "
    },
    "Syntax": {
        "term": "Syntax",
        "df": "The structure of a bit of language, considered without reference to truth, falsity, or meaning "
    },
    "Truth assignment": {
        "term": "Truth assignment",
        "df": "A function that maps the sentence letters in SL onto truth values. "
    }






}
