{
  "Categorical syllogism " : {"term": "Categorical syllogism ", 
          "df": "An argument with two premises composed of categorical statements." },
   "Conversion" : {"term": "Conversion", 
          "df": "The process of changing a sentence by reversing the subject and predicate."
          },
    "Copula": {"term":"Copula", 
    	"df" : "The form of the verb “to be” that links subject and predicate."
    },
    "Distribution": {
    	"term":"Distribution", 
    	"df": "A property of the terms of a categorical statement that is present when the statement makes a claim about the whole term."
    },
    "Logically structured English":{
    	"term":"Logically structured English",
    	"df": "English that has been regimented into a standard form to make its logical structure clear and to remove ambiguity. A stepping stone to full-fledged formal languages. "
    },
    "Major Premise":{
    	"term":"Major Premise",
    	"df": "The one premise in an Aristotelian syllogism that names the major term.  "
    },
    "Major term ":{
    	"term":"Major term ",
    	"df": "The term that is used as the predicate of the conclusion of an Aristotelian syllogism. "
    },
    "Middle term ":{
    	"term":"Middle term",
    	"df": "The one term in an Aristotelian syllogism that does not appear in the conclusion."
    },
    "Minor premise":{
    	"term":"Minor premise",
    	"df": "The one premise in an Aristotelian syllogism that names the minor term. "
    },
    "Formal logic":{
    	"term":"Formal logic ",
    	"df": "A way of studying logic that achieves content neutrality by replacing parts of the arguments being studied with abstract symbols. Often this will involve the construction of full formal languages."
    },
    "Mood-A statement":{
    	"term":"Mood-A statement",
    	"df": "A quantified categorical statement of the form “All S are P.”"
    },
    "Mood-E statement":{
    	"term":"Mood-E statement",
    	"df": " A quantified categorical statement of the form “No S are P.”  "
    },"Mood-I statement":{
    	"term":"Mood-I statement",
    	"df": "A quantified categorical statement of the form “Some S are P.”"
    },
    "Mood-O statement":{
    	"term":"Mood-O statement",
    	"df": "A quantified categorical statement of the form “Some S are not P.”  "
    },
    "Valid":{
    	"term":"Valid",
    	"df": "A property of arguments where it is impossible for the premises to be true and the conclusion false"
    },
    "Truth Value":{
    	"term":"Truth Value",
    	"df": "The status of a statement with relationship to truth. In our context, this means the status of a statement as true or false"
    },
    "Obversion":{
    	"term":"Obversion",
    	"df": "The process of transforming a categorical statement by changing its quality and replacing the predicate with its complement."
    },
    "Particular":{
    	"term":"Particular",
    	"df": "The quantity of a statement that uses the quantifier 'some'."
    },
    "Venn diagram ":{
    	"term":"Venn diagram ",
    	"df": "A diagram that represents categorical statements using circles that stand for classes. "
    },
    "Quantifier":{
    	"term":"Quantifier",
    	"df": "The part of a categorical sentence that specifies a portion of a class. "
    },
    "Statement mood":{
    	"term": "Statement mood",
    	"df": "The classification of a categorical statement based on its quantity and quality."
    }
    
    
    




}