{
  "1":{
    "1":{
        "sectionname": "What is Logic?",
        "sectionNum": "1",
        "sectionDescription": "Logic is a part of the study of human reason, the ability we have to think abstractly, solve problems, explain the things that we know, and infer new knowledge on the basis of evidence. Traditionally, logic has focused on the last of these items, the ability to make inferences on the basis of evidence, by evaluating the deductive validity of arguments. This section explains briefly what this means.",
        "title": "Logic as the systematic evaluation of arguments",
        "content":{
          "a":{
            "type":"p",
            "substance":[

              "In logic, we use the word 'argument' to refer to the attempt to show that certain evidence supports a conclusion. This is very different from the sort of argument you might have with your family, which could involve screaming and throwing things. We are going to use the word argument' a lot in this book, so you need to get used to thinking of it as a name for a rational process, and not a word that describes what happens when people disagree."
            ]
          },
          "b":{
            "type":"half",
            "substance":
                  [{
                    "type": "p",
              "substance":  ["A logical argument is structured to give someone a reason to believe some conclusion. To the right is a basic argument.",

                "In the argument above, sentences $P_1-P_3$ are the evidence. We call these the premises. The word therefore' indicates that the final sentence, marked with a C, is the conclusion of the argument. If you believe the premises, then the argument provides you with a reason to believe the conclusion. You might use reasoning like this purely in your own head, without talking with anyone else. You might wonder what the murder weapon is, and then mentally rule out each item, leaving only the candlestick. On the other hand, you might use reasoning like this while talking to someone else, to convince them that the murder weapon is the candlestick. (Perhaps you are playing as a team.) Either way the structure of the reasoning is the same. "]

              },
              {
                "type": "argument",
                "premises":["$P_1$: Bob plays an instrument of the violin family.",
                "$P_2$: Bob plays neither the cello nor the viola"],
                "conclusion":"$C$: So Bob plays either the violin or the double bass."
              }
            ]
          },
          "e":{
            "type":"scroll"
          },
          "d":{
            "type": "p",
            "substance":[
              "We can define logic then more precisely as the part of the study of reasoning that focuses on argument. In more casual situations, we will follow ordinary practice and use the word ``logic'' to either refer to the business of studying human reason or the thing being studied, that is, human reasoning itself. While logic focuses on argument, other disciplines, like decision theory and cognitive science, deal with other aspects of human reasoning, like abstract thinking and problem solving more generally. Logic, as the study of argument, has been pursued for thousands of years by people from civilizations all over the globe. The initial motivation for studying logic is generally practical. Given that we use arguments and make inferences all the time, it only makes sense that we would want to learn to do these things better.  Once people begin to study logic, however, they quickly realize that it is a fascinating topic in its own right. Thus the study of logic quickly moves from being a practical business to a theoretical endeavor people pursue for its own sake. ",

              "Whether we are pursuing logical for practical or theoretical reasons, our focus is on argument. The key to studying argument is to set aside the subject being argued about and to focus on the way it is argued for. The violin example earlier was convincing partly because we know that there are exactly four members of the violin family. However, the kind of reasoning used in that example was just the process of elimination. Process of elimination can be applied to any subject. Suppose a group of friends is deciding which restaurant to eat at, and there are six restaurants in town. If you could rule out five of the possibilities, you would use an argument just like the one above to decide where to eat. Because logic sets aside what an argument is about, and just looks at how it works rationally, logic is said to have content neutrality. If we say an argument is good, then the same kind of argument applied to a different topic will also be good.  If we say an argument is good for solving murders, we will also say that the same kind of argument is good for deciding where to eat, what kind of disease is destroying your crops, or who to vote for."


            ]
          }
        }
    },
    "2":{
      "title": "The structure of an argument",
      "content":{
        "a":{
          "type": "p",
          "substance":[
            "So far we have defined logic as the study of argument and outlined its relationship to related fields. To go any further, we are going to need a more precise definition of what exactly an argument is. We have said that an argument is not simply two people disagreeing; it is an attempt to prove something using evidence. More specifically, an argument is composed of sentences. In logic, we define a sentence as a unit of language that can be true or false. To put it another way, it is some combination of words or symbols that have been put together in a way that lets someone agree or disagree with it.",

            "As a result, 'sentences' in this text does not include questions, commands, exclamations, or sentence fragments. Someone who asks a question like 'Does the grass need to be mowed?' is typically not claiming that anything is true or false. (Sometimes people make sentences and disguise them as questions, for instance if they were trying to hint that the lawn needs to be mowed. These are generally called rhetorical questions, and we will leave the study of them to the rhetoricians.) Generally, questions will not count as sentences, but {answers will. What is this course about?' is not a sentence. 'No one knows what this course is about,' is a sentence.",

            "For annoying (but plausible) philosophical reasons, some philosophers describe the components of argument as 'propositions,' or `assertions,' and we will use these terms sometimes as well.  There is actually a great deal of disagreement about what the differences between all of these things are and which term is best used to describe parts of arguments. However, none of that makes a difference for this textbook. We could have used any of the other terms in this text, and it wouldn't change anything."

          ]
        }
      }
    }
  }
}
