{
  "1":{
    "1":{
        "sectionname": "What is Logic?",
        "sectionNum": "1",
        "sectionDescription": "Logic is a part of the study of human reason, the ability we have to think abstractly, solve problems, explain the things that we know, and infer new knowledge on the basis of evidence. Traditionally, logic has focused on the last of these items, the ability to make inferences on the basis of evidence, by evaluating the deductive validity of arguments. This section explains briefly what this means.",
        "title": "Logic as the systematic evaluation of arguments",
        "quote":{
          "lines":[
            "M: An argument isn't just contradiction.",
            "O: Well! it CAN be!",
            "M: No it can't! An argument is a connected series of statements intended to establish a proposition.",
            "O: No it isn't!",
            "M: Yes it is! 'tisn't just contradiction."
          ],
          "source":{
          "name":  "Monty Python",
          "title":"Argument Clinic"
            }
        },
        "content":{
          "a":{
            "type":"p",
            "substance":[

              "In logic, we use the word 'argument' to refer to the attempt to show that certain evidence supports a conclusion. This is very different from the sort of argument you might have with your family, which could involve screaming and throwing things. We are going to use the word argument' a lot in this book, so you need to get used to thinking of it as a name for a rational process, and not a word that describes what happens when people disagree.",
              "A logical argument is structured to give someone a reason to believe some conclusion. Suppose you are wondering if you friend Bob plays the guitar. You can't quite remember exactly what he plays, but you do recall that he uses a bow. Since you know that guitars are plucked and not bowed, you conclude that Bob indeed does not play the guitar. "
            ]
          },
          "b":{
            "type":"half",
            "substance":
                  [{
                    "type": "p",
              "substance":  [

                "We can reconstruct this line of thought as an argument, like the one to the right. We call the two sentences above line premises. The word 'therefore' signifies that the sentence below the line is the $conclusion$ of the argument. If you believe the premises, then the argument provides you with a reason to believe the conclusion. You might use reasoning like this purely in your own head, without talking with anyone else.  Sometimes you might work things verbally. This is fine because the business of logic is to carry out what the philosopher Rudolf Carnap calls 'rational reconstructions:' we evaluate the rationality of inferences by making a attempt to frame it in a logical structure."]

              },
              {
                "type": "argument",
                "premises":["1: Bob plays a bowed instrument.",
                "2: Guitars are not bowed instruments"],
                "conclusion":"Therefore, Bob does not play the guitar"
              }
            ]
          },
          "e":{
            "type":"scroll",
            "eventId":"m1c1s1",
            "substance":[
              ["t1","First, consider a circle that contains all plucked instruments and another one that contains all bowed instruments."],
              ["t2", "Premise 1 tells that whatever instrument Bob plays belongs to the bowed circle. This can be represent by a smaller circle situated within the bowed circle. Based on this premise alone, do we have good enough reason to think that Bob does not play the guitar?"],
              ["t3", "Not quite - since that premise alone does not give us enough information to where guitars would be in this diagram. Premise 1 only implies that Bob's instrument is in the bowed circle - but the overlapping area is still part of that circle! What if guitars can be both plucked and bowed? Then it would belong in the middle. Premise 1 $by$ $itself$ does not discriminate against that."],
              ["t4", "This is exactly why the second premise is important: it tells us that guitars are not played with bows. This means that it is impossible for the guitar circle to be inside of the overlapping areas."]
            ]

          },
          "d":{
            "type": "p",
            "substance":[
              "This example showcases a core idea in formal logic: some inferences are $truth-preserving$:",

              "Whether we are pursuing logical for practical or theoretical reasons, our focus is on argument. The key to studying argument is to set aside the subject being argued about and to focus on the way it is argued for. The violin example earlier was convincing partly because we know that there are exactly four members of the violin family. However, the kind of reasoning used in that example was just the process of elimination. Process of elimination can be applied to any subject. Suppose a group of friends is deciding which restaurant to eat at, and there are six restaurants in town. If you could rule out five of the possibilities, you would use an argument just like the one above to decide where to eat. Because logic sets aside what an argument is about, and just looks at how it works rationally, logic is said to have content neutrality. If we say an argument is good, then the same kind of argument applied to a different topic will also be good.  If we say an argument is good for solving murders, we will also say that the same kind of argument is good for deciding where to eat, what kind of disease is destroying your crops, or who to vote for."


            ]
          }
        }
    },
    "2":{
      "title": "Euler and Venn diagrams",
      "content":{
        "a":{
          "type": "p",
          "substance":[
            "In 1880 English logician John Venn published two essays on the use of diagrams with circles to represent categorical propositions, like the ones in our Bob example. Venn noted that the best use of such diagrams so far had come from the brilliant Swiss mathematician Leonhard Euler, but they still had many problems, which Venn felt could be solved by bringing in some ideas about logic from his fellow English logician George Boole. Although Venn only claimed to be building on the long logical tradition he traced, since his time these kinds of circle diagrams have been known as Venn diagrams. While they might not be as elegant and powerful as some of the tools we will learn later on, they are still useful in evaluating arguments. Let us begin by distinguishing between Euler and Venn's diagrams."

          ]
        },
        "b":{
          "type":"scroll",
          "eventId":"m1c1s2",
          "substance":[
            ["t5","It is clear from the figure that all guitars are in fact plucked instruments. And outside of college logic classes, you may have seen people use a diagram like this to represent a situation where one group is a subclass of another. You may have even seen people call concentric circles like this a Venn diagram. But Venn did not think we should put one circle entirely inside the other if we just want to represent 'All X is Y.' Thus, technically speaking what we have here is an Euler diagrams, a precursor of the Venn diagram."],
            ["t6", "What's wrong with Euler diagrams? Venn pointed out that the circles in an Euler diagram like ours don't just say that 'all guitars are plucked instruments' They also say that it is not true that All plucked instruments are guitars'. But we don't necessarily know that if we have only asserted 'All guitars are plucked instrument.' It leaves it open whether the guitar circle should be smaller than or the same size as the plucked circle. In response to this, Venn suggested that to represent just the content of a single proposition, we should always begin by drawing partially overlapping circles."],
            ["t7", " This means that we always have spaces available to represent the four possible ways the terms can combine: Area 1 represents things that are plucked instruments but not guitars; area 2, things that are plucked instruments and guitars; area 3, things that are just guitars; and area 4 represents things that are neither plucked instruments nor guitars."],
            ["t8", " We can then mark up these areas to indicate whether something is there or could be there. We shade a region of the diagram to represent the claim that nothing can exist in that region. For instance, if we say ``All plucked instruments are guitars,'' we are asserting that nothing can exist that is in the plucked instruments circle unless it is also in the guitars circle. So we shade out the part of the plucked instruments circle that doesn't overlap with guitars."]
          ]

        }
      }
    },
    "3":{
      "title": "Logicize",
      "content":{
        "a":{
          "type": "logicize"
        }
      }
    }
  }
}
