{
    "setup": {
        "Background": "Springbreak is upon us and a large group of Duke students have decided to spend the week on a relatively unknown island called Logicland. Unfortunately, students from a rival school called Douche University found out about this. Determined to not let Duke students have the island all for themselves, a large group of Douche students decide to go there as well. Now, this usually peaceful island is full of college students looking for good times. Douche students like to pose as Duke students. (But can you really blame them?) Unfortunately, there is no way to tell them apart by appearances. However, the following fact is absolutely certain: Duke students always tell the truth and Douche students always lie (that is, only state falsehood). You also know that on the island everyone goes to one of the two schools, but not both. So if someone doesn't go to Duke, then they must go to Douche, and vice versa.",
        "Goal": "Your job is to answer the questions about the people you meet on the island based on evidence presented to you, using a scale from 0 to 10 to represent your best estimation. For instance, many of the questions will ask you how strongly you believe that a certain person is a Duke student. If you are absolutely sure that the student goes to Duke, then you should pick 10. On the other hand, if you are sure that the student goes to Douche, then you should pick 0.",
        "Uncertain Answer": "You can use values in between to indicate the degrees of uncertainty. For instance, if you feel that you have no evidence at all to answer one way or another, you can pick 5, which says that you are 50-50. On the other hand, if you are not absolutely sure but you believe the person is more likely to be a Duke student, then you can pick something between 6 and 9, depending on how much evidence you think you have.",
        "Score Calculation": "Your score depends on how good your guesses are. Picking 10 or 0 get you the maximum possible score, but also the highest penalty (so riskier). Suppose you were asked if a student goes to Duke. You will be penalized if the person is in fact a Douche student but you answered absolutely (picking 0) that she goes to Duke, but you get maximum possible score if she does go to Duke. Anything in between get partial scores, and the closer you are the higher score you will get. For example, picking 7 would yield a pretty good score (but not as high as you would if you picked 10) if the person goes to Duke. If, however, she goes to Douche, you won't be penalized much by picking 7 - as a matter of fact you will get a small partial score. So it is up to you to make the best strategy to get the best score possible. Sometimes you just don't have any evidence to think one way or another. In that case, pick 5 will yield the best score. If you want to know exactly how the scores are calculated, look up something called the 'Brier/quadratic scoring rule'."
    },
    "problems": [
      {
            "setup": ["Suppose you interviewed all students on the island, and they all say to you: 'Everyone goes to the same school.' Evaluate your certainty for the statements below. 10 means certainty true and 0 certainty false."],
            "question": [
                ["Everyone goes to the same school", 10],["Everyone goes to Duke",10]
            ]
        },
         {
            "setup": ["Suppose you interviewed all students on the island, and they all say to you: 'Some of us go to Duke and some of us go to Douche.' Evaluate your certainty for the statements below. 10 means certainty true and 0 certainty false."],
            "question": [
                ["Everyone goes to the same school", 10],["Some people are Duke students", 0], ["Some people are Douche students", 10], ["Some people are Duke students", 0], ["Everyone is a Duke student", 0]
            ]
        },
        {
           "setup": ["Suppose you spoke to all students on the island, except for one, who passed out from drinking. They all said: Everyone goes to Douche University here.", "The next day, you are able to talk to the passed out student. You ask: Is it true that everyone goes to Douche here?","The student gave a yes or no answer."],
           "question": [
               ["Is the drunk student Duke student?", 10],["Every goes to Duke", 0], ["Everyone goes to the same school", 0]
           ]
       },{
          "setup": ["Imagine that you are interested in the drinking habit of students on the island. You interviewed all of them and they all said the same thing: “All Duke students drink.” What do we know?"],
          "question": [
              ["Everyone goes to the same school.", 10],["Everyone is a Duke student", 10], ["Everyone drinks", 10], ["Some people drink", 10],["Some Duke students drink", 10]
          ]
      },
      {
         "setup": ["Imagine that you are interested in the drinking habit of students on the island. You interviewed all of them and they all said the same thing: Some Douche students drink. What do we know?"],
         "question": [
            ["Everyone goes to the same school.", 10],["Everyone is a Duke student", 0], ["Everyone drinks", 0], ["Some people drink", 0]
         ]
     },
     {
       "setup": ["Imagine that you are interested in the drinking habit of students on the island. You interviewed all of them and they all said the same thing: If I drink, then everyone drinks. What do we know?"],
       "question": [
          ["Everyone goes to the same school.", 10],["Everyone is a Duke student", 10], ["Everyone drinks", 5], ["Some people drink", 5]
       ]
    },
    {
      "setup": ["Imagine that you are interested in the drinking habit of students on the island. You interviewed all of them and they all said the same thing: If someone drinks, then I drink. What do we know?"],
      "question": [
         ["Everyone goes to the same school.", 10],["Everyone is a Duke student", 10], ["Everyone drinks", 5], ["Some people drink", 5]
       ]
   },
   {
     "setup": ["Imagine that you are interested in the drinking habit of students on the island. You interviewed all of them and they all said the same thing: Some people drink, but I don't. What do we know?"],
     "question": [
        ["Everyone goes to the same school.", 10],["Everyone is a Duke student", 0], ["Everyone drinks", 5], ["Some people drink", 5]
      ]
  }

      ]



}
