{
  "vennSyl":{
    "title": "Venn Diagrams and Syllogistic Validity",
    "shortDescription":"Based on the given argument, complete the Venn diagram and determine its validity.",
    "eventId":"vennSyl"
  },
  "truthTable1":{
    "title": "Truth Table Logicise 1",
    "shortDescription":"Provide the correct values for the truth table.",
    "eventId":"truthTable1"
  },
  "truthTable2":{
    "title": "Truth Table Logicise 2",
    "shortDescription":"Provide the correct values for the truth table, and then determine if the argument is valid or consistent.",
    "eventId":"truthTable2"
  },
  "wason1":{
    "title": "Wason Selection Task",
    "shortDescription":"Click the cards required to determine whether the given statement is true or false.",
    "eventId":"wason1"
  },
  "truthTable3":{
    "title": "Truth Table Logicise 3",
    "shortDescription":"Provide the correct values for the truth table, and then determine if the argument is valid or consistent.",
    "eventId":"truthTable2"
  },
  "tree1":{
    "title": "Tree 1",
    "shortDescription":"Provide the correct values for the truth table, and then determine if the argument is valid or consistent.",
    "eventId":"tree1"
  },
  "model1":{
    "title": "Model 1",
    "shortDescription":"Based on the model provided, provide the correct values for the table.",
    "eventId":"model1"
  },
  "alienTree1":{
    "title": "Alien Family Tree 1",
    "shortDescription":"Alien Family Tree.",
    "eventId":"alienTree1",
    "tutorial":[
      "You will be given an Alien family tree as a model, and a PL statement to interpret based on the relationship delineated by the tree. Symbolization key and some explanation where needed:",
      "A: x is a ancestor of y - there is a direct path from x to y, and order matters as x has to come before y.",
      "P: x is parent of y. x comes directly before y. Every alien only has one parent.",
      "C: x is child of y. x comes directly after y. An alien can have zero to many children.",
      "L: x is of the same lineage as y. x and y are on the same path, where order does not matter.",
      "R: x is same race as y. Race refers to the color of the aliens - so same race means same color.",
      "S: x is sibling of y. x and y share the same parent.",
      "F: x is from the same family as y. x is a sibling, child, or parent of y.",
      "B: x is blue.",
      "D: x is red.",
      "K: x is black.",
      "G: x is green.",
      "U: x is purple."    ]
  }
}
