{
  "vennSyl":{
    "title": "Venn Diagrams and Syllogistic Validity",
    "shortDescription":"Based on the given argument, complete the Venn diagram and determine its validity.",
    "eventId":"vennSyl"
  },
  "truthTable1":{
    "title": "Truth Table Logicise 1",
    "shortDescription":"Provide the correct values for the truth table.",
    "eventId":"truthTable1"
  },
  "truthTable2":{
    "title": "Truth Table Logicise 2",
    "shortDescription":"Provide the correct values for the truth table, and then determine if the argument is valid or consistent.",
    "eventId":"truthTable2"
  },
  "wason1":{
    "title": "Wason Selection Task",
    "shortDescription":"Click the cards required to determine whether the given statement is true or false.",
    "eventId":"wason1"
  },
  "truthTable3":{
    "title": "Truth Table Logicise 3",
    "shortDescription":"Provide the correct values for the truth table, and then determine if the argument is valid or consistent.",
    "eventId":"truthTable2"
  },
  "tree1":{
    "title": "Tree 1",
    "shortDescription":"Provide the correct values for the truth table, and then determine if the argument is valid or consistent.",
    "eventId":"tree1"
  },
  "model1":{
    "title": "Model 1",
    "shortDescription":"Based on the model provided, provide the correct values for the table.",
    "eventId":"model1"
  },
  "alienTree1":{
    "title": "Alien Family Tree 1",
    "shortDescription":"Alien Family Tree.",
    "eventId":"alienTree1",
    "intro":"Press 'Confirm' to begin. Press 'Tutorial' on a detailed explanation of the logicise. Press 'Show Symbolization' to see the meaning of the predicate. Answer the problem by clicking the 'Choose Truth Value' button.",
    "tutorial":[
      "You will be given an Alien family tree as a model, and a PL statement to interpret based on the relationship delineated by the tree. Symbolization key and some explanation where needed.",
      "Some important terminology: if a two-place predicate, say, P is said to be reflexive, it means Pxx has to be true. For instance, Fxx is true for any x because each alien is from the same family as itself. Symmetry means if Pxy is true, Pyx also has to be true.  Asymmetry means if can only true in one direction: if Pxy is true then Pyx has to be false.",
      "A: x is a ancestor of y - there is a direct path from x to y, and order matters as x has to come before y. Cannot be reflexive: no one can be an ancestor of itself. ",
      "P: x is parent of y. x comes directly before y. Every alien only has one parent. Non-reflexive, and asymmetric.",
      "C: x is child of y. x comes directly after y. An alien can have zero to many children. Asymmetric.",
      "L: x is of the same lineage as y. x and y are on the same path, where order does not matter. reflexive and symmetric. ",
      "R: x is same race as y. Race refers to the color of the aliens - so same race means same color. reflexive and symmetric. ",
      "S: x is sibling of y. x and y share the same parent. Non-reflexive and symmetric.",
      "F: x is from the same family as y, that is: x is a sibling, child, or parent of y. Reflexive and symmetric.",
      "G: x is a grandparent of y. Non-reflexive, and asymmetric.",
      "B: x is blue.",
      "D: x is red.",
      "U: x is purple."    ]
  }
}
