{
	"1":{
		"moduleNo": 1,
		"symbol" : "¬",
		"title": "Basic Concepts",
		"description": "We begin with learning the basic concepts in logic. We look at the role of argument in general, and what it means to evaluate arguments. We end with an introduction of formal logic - the topic of our class." ,
		"info": [["About the Test", "Test 1 will be mostly conceptual in nature. Be sure to understand concepts such as consistency, validity, etc. Be sure to understand the relationship between Venn diagram and basic categorical syllogism."]]
	},
	"2":{
		"moduleNo": 2,
				"symbol" :"∅" ,
		"title": "Sentence Logic: Introduction", 
		"description": " This module introduces a logical language called SL. It is a version of sentential logic, because the basic units of the language will represent statements, and a statement is usually given by a complete sentence in English. It also introduces a way of evaluating sentences and arguments of SL called the truth table method. As we shall see, the truth table method is semantic because it involves one aspect of the meaning of sentences, whether those sentences are true or false.",
		"info": [["About the Test", "Make sure you understand the part about recursive defintions and how to prove that some string is a wff. Be ready to construct a complete or an incomplete truth table for logical relations. I might ask you to do some translations. The wason selection task might also be in the test."]]
	},
	"3":{
		"moduleNo": 3,
		"title": "Sentence Logic: Proofs",
				"symbol" :"⊥" ,
		"description": "Blog chambray pug offal vinyl humblebrag health goth kogi beard affogato hashtag. Tattooed drinking vinegar meggings vinyl. Cliche XOXO distillery viral kogi kale chips. Vice seitan green juice, meh chia ugh church-key asymmetrical master cleanse distillery."
	},
	"4":{
		"moduleNo": 4,
		"title": "Predicate Logic: Syntax",
		"symbol" :"⊢" ,
		"description": "Blog chambray pug offal vinyl humblebrag health goth kogi beard affogato hashtag. Tattooed drinking vinegar meggings vinyl. Cliche XOXO distillery viral kogi kale chips. Vice seitan green juice, meh chia ugh church-key asymmetrical master cleanse distillery." 
	},
	"5":{
		"moduleNo": 5,
		"title": "Predicate Logic: Semantics",
		"symbol" :"∀" ,
		"description": "Butcher you probably haven't heard of them ennui sartorial. Bitters try-hard 3 wolf moon actually before they sold out. Kinfolk neutra normcore meh, cred meditation health goth vice kickstarter craft beer. Messenger bag celiac tumblr church-key put a bird on it, affogato helvetica irony before they sold out vinyl ugh kogi typewriter." 
	},
	"6":{
		"moduleNo": 6,
		"title": "Predicate Logic: Proofs",
		"symbol" :"⊨" ,
		"description": "Actually YOLO kale chips, meditation fap mlkshk photo booth keffiyeh artisan fingerstache normcore humblebrag you probably haven't heard of them letterpress.  "  
	},
	"7":{
		"moduleNo": 7,
		"title": "Predicate Logic: Identity",
		"symbol" :"∃" ,
		"description": "Messenger bag celiac tumblr church-key put a bird on it, affogato helvetica irony before they sold out vinyl ugh kogi typewriter." 
	},
	"8":{
		"moduleNo": 8,
		"title": "Review and Metalogic",
		"symbol" :"∴" ,
		"description":" Mustache before they sold out bitters try-hard sartorial. Forage actually organic disrupt waistcoat, XOXO kitsch portland venmo. Chambray semiotics franzen, bespoke biodiesel asymmetrical umami chicharrones. Deep v semiotics kombucha, hella lumbersexual photo booth narwhal vinyl craft beer.."
	}
}