{
	"1":{
		"moduleNo": 1,
		"symbol" : "¬",
		"title": "Basic Concepts",
		"description": "We begin with learning the basic concepts in logic. We look at the role of argument in general, and what it means to evaluate arguments. We end with an introduction of formal logic - the topic of our class." ,
		"info": [["About the Test", "Test 1 will be mostly conceptual in nature. Be sure to understand concepts such as consistency, validity, etc. Be sure to understand the relationship between Venn diagram and basic categorical syllogism."]]
	},
	"2":{
		"moduleNo": 2,
				"symbol" :"∅" ,
		"title": "Sentence Logic: Introduction",
		"description": " This module introduces a logical language called SL. It is a version of sentential logic, because the basic units of the language will represent statements, and a statement is usually given by a complete sentence in English. It also introduces a way of evaluating sentences and arguments of SL called the truth table method. ",
		"info": [["About the Test", "Make sure you understand the part about recursive definitions and how to prove that some string is a wff. Be ready to construct a complete or an incomplete truth table for logical relations. I might ask you to do some translations. The wason selection task might also be in the test."]]
	},
	"3":{
		"moduleNo": 3,
		"title": "Sentence Logic: Proofs",
				"symbol" :"⊥" ,
		"description": "In this module, we are going to introduce a new method for checking for validity and other logical properties. This time our method is going to be purely syntactic. We won’t be at all concerned with what our symbols mean. We are just going to look at the way they are arranged. Our method here will be called a system of natural deduction. When you use a system of natural deduction, you won’t do it mechanically.",
		"info":[
			["Practice Problems",

				"Much of the work will involve working through the problems. Be sure to work through <a href= '..\\pdf\\practice3.pdf'>the practice problems</a> before taking the tests. No solution is given for these problems, because they are intended for you work through and seek help from me in class. For the module quiz, problems with solutions will be given. Make sure that you are pretty comfortable with them before making an attempt at the quiz."],
			["Natural Deduction Slides",
				"<a href = '..\\pdf\\ND1.pdf'>1</a>,<a href = '..\\pdf\\ND2.pdf'>2</a>"]
		]
	},
	"4":{
		"moduleNo": 4,
		"title": "Quantified Logic: Syntax",
		"symbol" :"∀" ,
		"description": "This module introduces a logical language called QL. It is a version of quantified logic, because it introduces words like all and some, which tell us about quantities. Quantified logic is also sometimes called predicate logic, because the basic units of the language are predicates and terms."
	},
	"5":{
		"moduleNo": 5,
		"title": "Quantified Logic: Basic Deduction",
		"symbol" :"⊢" ,
		"description": "For proofs in QL, we use all of the basic rules of SL plus four new basic rules: both introduction and elimination rules for each of the quantifier. Since all of the derived rules of SL are derived from the basic rules, they will also hold in QL. We will add another derived rule, a replacement rule called quantifier negation."
	},
	"6":{
		"moduleNo": 6,
		"title": "Model Semantics and Identity",
		"symbol" :"⊨" ,
		"description": "In Module 2 we developed the truth table system, a semantic method for evaluating sentences and arguments in SL. The method was called semantic, because it involved establishing meanings for all the non-logical parts of a sentence, in this case, the sentence letters. Because QL is a more complicated system than SL developing semantics for QL will be much more complicated, and there will be greater limitations for what we can do with these methods. The identity predicate is not part of QL, but we add it when we need to symbolize certain sentences."
	},
	"7":{
		"moduleNo": 7,
		"title": "Quantified Logic: Advanced Deduction ",
		"symbol" :"∃" ,
		"description": "Natural deduction in earnest! In this module we will work on the most complex derivations in this course. We use our system of derivation to prove theorems involving quantifiers and predicates. We also add two rules of proof to deal with identity."
	},
	"8":{
		"moduleNo": 8,
		"title": "Review and Metalogic",
		"symbol" :"∴" ,
		"description":"It seems natural that provability and semantic entailment should agree. Yet, do not be fooled by the similarity of the symbols. The fact that these two are really interchangeable is not a simple thing to prove.This is the problem of soundness. A proof system is sound if there are no proofs of invalid arguments. Demonstrating that the proof system is sound would require showing that any possible proof is the proof of a valid argument. It would not be enough simply to succeed when trying to prove many valid arguments and to fail when trying to prove invalid ones."
	}
}
