{
  "0": {
    "question": "If an argument is inductively firm(good), then the premises render the conclusion ____. Nevertheless, unlike a deductively valid argument, it is possible for the conclusion to be ____ even if the premises are _____.",
    "real": "probable, false, true",
    "fake": ["probable, true, false", "possible, false, true", "improbable, true, false"],
    "type": "mc",
    "id": "quiz1_1"
  },

  "1": {
    "question": "It is impossible for a valid argument to have false premises and a true conclusion.",
    "real": "False",
    "fake": ["True"],
    "type": "mc",
    "id": "quiz1_2"

  },
  "2": {
    "question": "Which of the following pairs of statement are logically equivalent?",
    "real": "Thelonious Monk played gigs with John Coltrane. John Coltrane played gigs with Thelonious Monk.",
    "fake": ["Thelonious Monk played piano. John Coltrane played tenor sax.", "All professional piano players have big hands. Piano player Bud Powell had big hands.", "Bud Powell suffered from severe mental illness. All piano players suffer from severe mental illness.", "John Coltrane was deeply religious. John Coltrane viewed music as an expression of spirituality."],
    "type": "mc",
    "id": "quiz1_3"
  },
  "3": {
    "question": "Which pair of the following pairs of statement is logically equivalent? There's only one pair; the rest are not equivalent.",
    "real": "1. Elephants dissolve in water. 2. If you put an elephant in water, it will disintegrate.",
    "fake": ["1. All mammals dissolve in water.2. If you put an elephant in water, it will disintegrate. ", "1. All mammals dissolve in water. 2. Elephants dissolve in water."],
    "type": "mc",
    "id": "quiz1_3"
  },
  "4": {
    "question": "Consider this statement: Wood is a light, durable substance useful for building things. Is this a tautology, contradiction, or contingent statement? ",
    "real": "a contingent statement",
    "fake": ["tautology", "contradiction"],
    "type": "mc",
    "id": "quiz1_4"
  },
  "5": {
    "setup": "Consider these statements: (a) There are at least four giraffes at the wild animal park.(b) There are exactly seven gorillas at the wild animal park. (c) There are not more than two Martians at the wild animal park. (d) Every giraffe at the wild animal park is a Martian.",
    "question": "which set of the following statements are inconsistent?",
    "real": "(a), (c), (d)",
    "fake": ["(b), (c), (d)", "(a), (b), (d)", "(a), (b), (c)"],
    "type": "mc",
    "id": "quiz1_5"
  },

  "6": {
    "question": "Consider this statement: I live in a three story building that is two stories tall. Is this a tautology, contradiction, or contingent statement? ",
    "real": "contradiction",
    "fake": ["a contingent statement", "tautology"],
    "type": "mc",
    "id": "quiz1_6"
  },


  "7": {
    "question": "Consider this pair of sentences: Barack Obama is the 44th president. Barack Obama was president immediately after the 43rd president. Are they logically equivalent?",
    "real": "Yes",
    "fake": ["No",
      "Sometimes, but not always."
    ],
    "type": "mc",
    "id": "quiz1_7"
  },
  "8": {
    "setup": [["a"," All people are mortal."], ["b"," Socrates is a person."], ["c"," Socrates will never die."], ["d"," Socrates is mortal"]],
    "setuptype": "list",
    "question": "Based on the statements below, which set of the following is consistent?",
    "real": "(a), (b), (c), (d)",
    "fake": ["(a), (d)", "(a), (c)"],
    "type": "mc",
    "id": "quiz1_8"
  },


  "9": {
    "setup":[["a"," All people are mortal."], ["b"," Socrates is a person."], ["c"," Socrates will never die."], ["d"," Socrates is mortal"]],
    "question": "Based on the statements below, which set of the following is consistent?",
    "setuptype": "list",
    "real": "(b), (c)",
    "fake": ["(a), (b), (c)", "(b), (c), (d)"],
    "type": "mc",
    "id": "quiz1_9"
  }



}