{
	"symboliclogic":{
		"title": "Symbolic Logic",
		"description": "is an artificial language developed by logicians to deal with philosophical and mathematical problems in a precise manner. From antiquity to our time, it was crucial to many intellectual developments. It is a core element in linguistics, computer science and yes, philosophy. One would gain a better understanding of these fields simply by virtue of being familiar with logical notation." 
	},
	"aboutthiscourse":{
		"title": "About This Course",
		"description": "How do we really prove something? This question strikes at the heart of philosophy: can we ever be certain that we know something? Successfully or not, philosophers through the ages provided us multifarious answers to this difficult problem, none of which have provided the final solution. Be there as it may, the purpose of this course is to explore one venerable tradition - the method of deduction. Deductive logic aims for indubitable certainty and calls for relentless precision. If the course is successful, the intellectual and aesthetic value of deductive proofs will magically emerge in front of your eyes from previously meaningless symbols... Some say that this induces a state of mind that is religious or even mystical. (However, such experience, no matter how profound, does not necessarily lead to a good grade.)"
	},
	"courceformat":{
		"title": "Conditionally Self-Paced",
		"description": "This course is conditionally self-paced:  you will decide when to turn in an assignment take a particular test, under certain progress-conducive conditions. The aim of this structure aims to accommodate the diversity of backgrounds and learning styles and to give the help and structure that suit each student's individual needs. This class structure is adapted from Professor G. Randolph Mayes' logic course at Sacramento State University.  For more info, see the 'Grading and Policy' page"
	},
	"textbook":{
		"title": "Open Source Textbook",
		"description": "We will use a version of an open source textbook 'forall x' by J. Robert Loftis, who built upon the works of P.D. Magnus and Cathal Woods. As the educational material of this website is directly built upon their work, lokgic.io is licensed under a Creative Commons Attribution-ShareAlike 4.0 International License, which is compatible with the license under which both versions of 'forall x' were made. Source code for this website is available on github. See About page for more detail."
	},
	"modular":{
		"title":"Modular Progression",
		"description": "The course is structured around eight modules. As each of the modules builds on the previous one, it is recommended that they are done in order. Each module is divided into 4 phases: reading, concepts, quizzing and testing. Click the corresponding icon below to begin a module."
	}
}